In [4]:
import pandas as pd
import server.database as db
import sqlite3
import server.tba as tba

In [2]:
con = db.get_con()

In [3]:
pd.read_sql('SELECT * FROM Matches;', con)

    match           match_time alliance  station team_number
0     qm1  2022-04-02 21:15:00     blue        1     frc2097
1     qm1  2022-04-02 21:15:00     blue        2     frc4579
2     qm1  2022-04-02 21:15:00     blue        3     frc4469
3     qm1  2022-04-02 21:15:00      red        1     frc8386
4     qm1  2022-04-02 21:15:00      red        2     frc8303
..    ...                  ...      ...      ...         ...
367  qm62  2022-04-03 18:22:00     blue        2     frc1258
368  qm62  2022-04-03 18:22:00     blue        3     frc3588
369  qm62  2022-04-03 18:22:00      red        1     frc2929
370  qm62  2022-04-03 18:22:00      red        2     frc5941
371  qm62  2022-04-03 18:22:00      red        3     frc4918

[372 rows x 5 columns]

In [6]:
matches = tba.get_matches('2022wabon')

In [29]:
our_matches = []
for ind, match in enumerate(matches):
    if match['team_number'] == 'frc1318':
        our_matches.append(match['match'])
our_matches

['qm2',
 'qm7',
 'qm12',
 'qm20',
 'qm24',
 'qm31',
 'qm34',
 'qm38',
 'qm46',
 'qm52',
 'qm55',
 'qm58']

In [33]:
m2 = []

In [34]:
for match in matches:
    if int(match['match'][2:]) in [2,7,12,20,24,31,34,38,46,52,58,55]:
        m2.append(match)

In [35]:
mdf = pd.DataFrame(m2)

In [36]:
mdf['team_number'] = pd.to_numeric(mdf['team_number'].str[3:])

In [ ]:
for

In [25]:
mdf[mdf['team_number']==3218]

   match  station  team_number alliance           match_time
4    qm2        2         3218      red  2022-04-02 21:25:00
35  qm31        3         3218      red  2022-04-03 01:33:00
59  qm52        3         3218      red  2022-04-03 17:12:00

In [26]:
mdf[mdf['team_number']==1318]

   match  station  team_number alliance           match_time
5    qm2        3         1318      red  2022-04-02 21:25:00
7    qm7        2         1318     blue  2022-04-02 22:15:00
12  qm12        1         1318     blue  2022-04-02 22:57:30
22  qm20        2         1318      red  2022-04-03 00:16:00
27  qm24        1         1318      red  2022-04-03 00:44:00
34  qm31        2         1318      red  2022-04-03 01:33:00
39  qm34        1         1318      red  2022-04-03 02:14:00
42  qm38        1         1318     blue  2022-04-03 02:42:00
50  qm46        3         1318     blue  2022-04-03 16:30:00
55  qm52        2         1318     blue  2022-04-03 17:12:00
62  qm55        3         1318     blue  2022-04-03 17:33:00
71  qm58        3         1318      red  2022-04-03 17:54:00

In [31]:
# twodmatch = []
# for match in our_matches:
#     onedmatch = []
#     print(mdf[mdf.match == match]['team_number'])

In [77]:
mdf[mdf['team_number']==2910]['alliance']

29    red
Name: alliance, dtype: object

In [78]:
mdf.loc[(mdf['team_number']==1318)&(mdf['match'].isin(list(mdf.query("team_number == 2910")['match'])))]['alliance']

27    red
Name: alliance, dtype: object

In [83]:
for i in range(10):
    type(mdf.iloc[i])

In [112]:
for i in mdf.iterrows():
    ourmatch = mdf[(mdf['team_number'] == 1318)&(mdf['match'] == i[1][0])]
    theiralliance = mdf.iloc[i[0]]['alliance']
    ouralliance = ourmatch['alliance']

In [109]:
s1 = mdf[(mdf['team_number']==1318)&(mdf['match']=='qm2')]['alliance']

In [ ]:
pd.Series